{{ define "page" }}

<img src="/data/movie/Functions_animation.gif" height="400"><br>
<h3>ページ内検索</h3>
<img src="/data/image/screenshot/page.png" height="600"><br>
isearの最も基礎的な機能です。<br>
特徴として、複数ワードを色分けして検索することができます。<br>
<h4>操作</h4>
拡張機能のアイコンをクリックしたらポップアップが出現します。<br>
検索ワードを入力したら[Enter]で確定してください。<br>

<h4>複数ワード検索</h4>
スペース区切りで複数ワード検索が可能です。<br>
スペースを検索したいときは、「"」「'」を利用してください。<br>
<strong>例: "iphone 7"</strong>

<h4>検索ワードを巡回する</h4>
次のいずれかで検索したワードを巡回することができます。<br>
<ul>
	<li>テキストボックス内で[Enter]</li>
	<li>カラフルなボタンをクリック</li>
	<li>ハイライトバーをクリック</li>
</ul>
全て[Shift]を押しながらだと逆に巡回できます。

<h4>ページ内のワードを検索ワードとして追加</h4>
ページ内の検索したいワードを範囲選択後、右クリックメニューを開いて<strong>「isear 検索ワードに追加」</strong>をクリックしてください。


<h3>Google検索</h3>
Google検索の検索ワードを自動的に取得し、自動的にハイライトしてくれます。(設定で変更可能です)<br>
検索ワードボックス内で[Ctrl+Enter]もしくは[Ctrl+Shift+Enter]を入力することで、Google検索をすることができます。<br>
[Ctrl+Shift+Enter]の場合、新しいタブで検索します。

<h3>ハイライトバー</h3>
<img src="/data/image/screenshot/bar.png" height="600"><br>
設定によってハイライトバーを有効にすると、カラフルなバーがwebページの右端に表示されるようになります。<br>
これには次のような特徴があります。
<ul>
	<li>ページ内でハイライトした位置がスクロールバーの横に表示され、ページ上のどこに検索対象があるのかがすぐにわかる</li>
	<li>ハイライトバーをクリックすることで、ワードごとにハイライトを巡回することができる</li>
	<li>アイコンの右クリックメニューから表示・非表示を簡単に切り替えることができる</li>
</ul>

<h3></h3>


{{ end }}